In [ ]:
# 316p~342p

In [ ]:
# 데이터의 그룹 연산
# 5.2.1 데이터 객체를 그룹 연산
# GroupBy 객체 속성

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A' : ['ha', 'hi', 'ho', 'ha', 'ho'],
                   'B' : ['one', 'two', 'one', 'one', 'two'],
                   'Data1' : np.random.randn(5),
                   'Data2' : np.random.randn(5)})
df

    A    B     Data1     Data2
0  ha  one -2.100458 -0.928520
1  hi  two  0.159969  1.809810
2  ho  one  0.885189  0.674645
3  ha  one  0.481096  0.242501
4  ho  two -0.729543 -0.100440

In [3]:
grouped1 = df.groupby('A')
grouped1

In [4]:
gr_dict = dict(list(grouped1))
gr_dict

{'ha':     A    B     Data1     Data2
 0  ha  one -2.100458 -0.928520
 3  ha  one  0.481096  0.242501,
 'hi':     A    B     Data1    Data2
 1  hi  two  0.159969  1.80981,
 'ho':     A    B     Data1     Data2
 2  ho  one  0.885189  0.674645
 4  ho  two -0.729543 -0.100440}

In [5]:
grouped1.groups

{'ha': [0, 3], 'hi': [1], 'ho': [2, 4]}

In [6]:
gr_dict['ho']

    A    B     Data1     Data2
2  ho  one  0.885189  0.674645
4  ho  two -0.729543 -0.100440

In [7]:
grouped1.get_group('ho')

    A    B     Data1     Data2
2  ho  one  0.885189  0.674645
4  ho  two -0.729543 -0.100440

In [8]:
grouped1.mean()

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1325/318625505.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped1.mean()

       Data1     Data2
A
ha -0.809681 -0.343009
hi  0.159969  1.809810
ho  0.077823  0.287103

In [9]:
grouped2 = df['Data2'].groupby(df['A'])
grouped2

In [10]:
grouped2.mean()

A
ha   -0.343009
hi    1.809810
ho    0.287103
Name: Data2, dtype: float64

In [11]:
grouped3 = df['Data1'].groupby([df['A'], df['B']])
grouped3.groups

{('ha', 'one'): [0, 3], ('hi', 'two'): [1], ('ho', 'one'): [2], ('ho', 'two'): [4]}

In [12]:
grouped3

In [13]:
grouped3.mean()

A   B
ha  one   -0.809681
hi  two    0.159969
ho  one    0.885189
    two   -0.729543
Name: Data1, dtype: float64

In [14]:
material = np.array(['water', 'oil', 'oil', 'water', 'oil'])
time = ['1hr', '1hr', '2hr', '2hr', '1hr']
df['Data1'].groupby([material, time]).mean()

oil    1hr   -0.284787
       2hr    0.885189
water  1hr   -2.100458
       2hr    0.481096
Name: Data1, dtype: float64

In [17]:
df2 = pd.DataFrame({'A' : ['ho', 'hi', 'ha'],
                    'B' : ['two', 'one', 'two'],
                    'Data1' : np.random.randn(3)})

In [18]:
df2.groupby(['A']).sum()

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1325/2523192079.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby(['A']).sum()

       Data1
A
ha  0.075662
hi  0.316065
ho -0.847815

In [16]:
df2.groupby('A', sort=False).sum()

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1325/1182059684.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby('A', sort=False).sum()

       Data1
A
ho -0.342263
hi  0.143184
ha -0.634715

In [19]:
arr = [['ha', 'ha', 'hi', 'hi', 'ho', 'ho'], ['one', 'two', 'one', 'one', 'two', 'two']]
ind = pd.MultiIndex.from_arrays(arr, names=['1st', '2nd'])
ser = pd.Series(np.random.randn(6), index=ind)
ser

1st  2nd
ha   one   -0.992440
     two    1.113123
hi   one   -0.377884
     one   -0.156006
ho   two    0.922138
     two   -1.718490
dtype: float64

In [22]:
ser.index

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('hi', 'one'),
            ('hi', 'one'),
            ('ho', 'two'),
            ('ho', 'two')],
           names=['1st', '2nd'])

In [23]:
grouped = ser.groupby(level=0)
grouped.sum()

1st
ha   -0.225992
hi   -1.304199
ho   -0.273986
dtype: float64

In [24]:
ser.groupby(level='2nd').sum()

2nd
one   -2.053117
two    0.248940
dtype: float64

In [20]:
grouped1 = df.groupby('A')
for name, group in grouped1 :
    print(name)

ha
hi
ho

In [21]:
for name, group in grouped1 :
    print(name)
    print(group)

ha
    A    B     Data1     Data2
0  ha  one -2.100458 -0.928520
3  ha  one  0.481096  0.242501
hi
    A    B     Data1    Data2
1  hi  two  0.159969  1.80981
ho
    A    B     Data1     Data2
2  ho  one  0.885189  0.674645
4  ho  two -0.729543 -0.100440

In [22]:
for (n1, n2), group in df.groupby(['A', 'B']):
    print((n1, n2))
    print(group)

('ha', 'one')
    A    B     Data1     Data2
0  ha  one -2.100458 -0.928520
3  ha  one  0.481096  0.242501
('hi', 'two')
    A    B     Data1    Data2
1  hi  two  0.159969  1.80981
('ho', 'one')
    A    B     Data1     Data2
2  ho  one  0.885189  0.674645
('ho', 'two')
    A    B     Data1    Data2
4  ho  two -0.729543 -0.10044

In [ ]:
# 5.2.2 GroupBy 객체를 그룹별 연산 및 변환
# 데이터 집계하기

In [23]:
df = pd.DataFrame({'A' : ['ha', 'hi', 'ho', 'ha', 'ho'],
                   'B' : ['one', 'two', 'one', 'one', 'two'],
                   'Data1' : np.random.randn(5),
                   'Data2' : np.random.randn(5)})
df

    A    B     Data1     Data2
0  ha  one  1.911990  0.143891
1  hi  two -1.281865  0.805536
2  ho  one  0.639692 -0.070220
3  ha  one -0.789769 -1.111118
4  ho  two  1.024956  0.926372

In [24]:
grouped1 = df.groupby('A')
grouped1.agg(np.sum)

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1325/3663713441.py:2: FutureWarning: The operation <function sum at 0x1039e1440> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  grouped1.agg(np.sum)

       Data1     Data2
A
ha  1.122220 -0.967226
hi -1.281865  0.805536
ho  1.664648  0.856153

In [25]:
grouped2 = df.groupby(['A', 'B'])
grouped2.agg('sum')

           Data1     Data2
A  B
ha one  1.122220 -0.967226
hi two -1.281865  0.805536
ho one  0.639692 -0.070220
   two  1.024956  0.926372

In [26]:
grouped3 = df.groupby(['A', 'B'], as_index=False)
grouped3.aggregate(np.sum)

    A    B     Data1     Data2
0  ha  one  1.122220 -0.967226
1  hi  two -1.281865  0.805536
2  ho  one  0.639692 -0.070220
3  ho  two  1.024956  0.926372

In [27]:
df.groupby('A', as_index=False).sum()

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1325/3040768419.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A', as_index=False).sum()

    A     Data1     Data2
0  ha  1.122220 -0.967226
1  hi -1.281865  0.805536
2  ho  1.664648  0.856153

In [28]:
grouped2.size()

A   B
ha  one    2
hi  two    1
ho  one    1
    two    1
dtype: int64

In [ ]:
# 한 번에 여러 함수 적용하기

In [35]:
grouped =df.groupby('A')
grouped['Data1'].agg([np.sum, np.mean, np.std])

         sum      mean       std
A
ha -0.043250 -0.021625  0.299735
hi  0.078221  0.078221       NaN
ho -0.364993 -0.182497  0.014350

In [36]:
grouped.agg([np.sum, np.mean])

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1072/1603074020.py:1: FutureWarning: ['B'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg([np.sum, np.mean])

       Data1               Data2
         sum      mean       sum      mean
A
ha -0.043250 -0.021625 -0.583255 -0.291628
hi  0.078221  0.078221  1.808595  1.808595
ho -0.364993 -0.182497 -0.891720 -0.445860

In [38]:
grouped['Data1'].agg([np.sum, np.mean]).rename(columns={'sum': '합계', 'mean': '평균'})

          합계        평균
A
ha -0.043250 -0.021625
hi  0.078221  0.078221
ho -0.364993 -0.182497

In [39]:
grouped.agg([np.sum, np.mean]).rename(columns={'sum': '합계', 'mean': '평균'})

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1072/728707214.py:1: FutureWarning: ['B'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg([np.sum, np.mean]).rename(columns={'sum': '합계', 'mean': '평균'})

       Data1               Data2
          합계        평균        합계        평균
A
ha -0.043250 -0.021625 -0.583255 -0.291628
hi  0.078221  0.078221  1.808595  1.808595
ho -0.364993 -0.182497 -0.891720 -0.445860

In [ ]:
# 데이터프레임 열들에 각각 다른 함수 적용하기

In [40]:
grouped.agg({'Data2': np.sum, 'Data1': lambda x: np.sum(x)})

       Data2     Data1
A
ha -0.583255 -0.043250
hi  1.808595  0.078221
ho -0.891720 -0.364993

In [41]:
from collections import OrderedDict

In [42]:
grouped.agg({'Data2': 'sum', 'Data1': np.mean})

       Data2     Data1
A
ha -0.583255 -0.021625
hi  1.808595  0.078221
ho -0.891720 -0.182497

In [43]:
df_grd = grouped.agg(OrderedDict([('Data2', 'sum'), ('Data1', 'mean')]))
df_grd

       Data2     Data1
A
ha -0.583255 -0.021625
hi  1.808595  0.078221
ho -0.891720 -0.182497

In [44]:
ind = ['gold', 'silver', 'gold']
df_grd.groupby(ind).sum()

           Data2     Data1
gold   -1.474976 -0.204122
silver  1.808595  0.078221

In [ ]:
# 자동차 판매 대리점별 영업 현황 데이터 연산과 변환

In [46]:
df = pd.read_excel('/Users/raekkkky/Desktop/DNA/Data_Analysis/data-collection-master/car_sales.xlsx')
df

    Branch  Car Name  Quantity  Unit Price  Ext Price
0  Yeonnam  Grandeur         7          35        245
1  Yeonnam    Sonata        11          20        220
2  Yeonnam    Avante         3          15         45
3  Sungsan  Grandeur         5          36        180
4  Sungsan    Sonata        19          19        361
5  Sungsan    Avante         9          14        126
6   Yeonhi  Grandeur        10          34        340
7   Yeonhi    Sonata        13          19        247
8   Yeonhi    Avante        15          13        195

In [47]:
df.groupby('Branch')['Ext Price'].agg('sum')

Branch
Sungsan    667
Yeonhi     782
Yeonnam    510
Name: Ext Price, dtype: int64

In [48]:
df.groupby('Branch')['Ext Price'].agg('sum').rename('Br_Total')

Branch
Sungsan    667
Yeonhi     782
Yeonnam    510
Name: Br_Total, dtype: int64

In [49]:
br_total = df.groupby('Branch')['Ext Price'].agg('sum').rename('Br_Total').reset_index()
br_total

    Branch  Br_Total
0  Sungsan       667
1   Yeonhi       782
2  Yeonnam       510

In [50]:
df_m = df.merge(br_total)
df_m

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total
0  Yeonnam  Grandeur         7          35        245       510
1  Yeonnam    Sonata        11          20        220       510
2  Yeonnam    Avante         3          15         45       510
3  Sungsan  Grandeur         5          36        180       667
4  Sungsan    Sonata        19          19        361       667
5  Sungsan    Avante         9          14        126       667
6   Yeonhi  Grandeur        10          34        340       782
7   Yeonhi    Sonata        13          19        247       782
8   Yeonhi    Avante        15          13        195       782

In [51]:
df_m['Br_Pct'] = df_m['Ext Price'] / df_m['Br_Total']
df_m

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total    Br_Pct
0  Yeonnam  Grandeur         7          35        245       510  0.480392
1  Yeonnam    Sonata        11          20        220       510  0.431373
2  Yeonnam    Avante         3          15         45       510  0.088235
3  Sungsan  Grandeur         5          36        180       667  0.269865
4  Sungsan    Sonata        19          19        361       667  0.541229
5  Sungsan    Avante         9          14        126       667  0.188906
6   Yeonhi  Grandeur        10          34        340       782  0.434783
7   Yeonhi    Sonata        13          19        247       782  0.315857
8   Yeonhi    Avante        15          13        195       782  0.249361

In [52]:
df.groupby('Branch')['Ext Price'].transform('sum')

0    510
1    510
2    510
3    667
4    667
5    667
6    782
7    782
8    782
Name: Ext Price, dtype: int64

In [53]:
df['Br_Total'] = df.groupby('Branch')['Ext Price'].transform('sum')
df['Br_Pct'] = df['Ext Price'] / df['Br_Total']
df

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total    Br_Pct
0  Yeonnam  Grandeur         7          35        245       510  0.480392
1  Yeonnam    Sonata        11          20        220       510  0.431373
2  Yeonnam    Avante         3          15         45       510  0.088235
3  Sungsan  Grandeur         5          36        180       667  0.269865
4  Sungsan    Sonata        19          19        361       667  0.541229
5  Sungsan    Avante         9          14        126       667  0.188906
6   Yeonhi  Grandeur        10          34        340       782  0.434783
7   Yeonhi    Sonata        13          19        247       782  0.315857
8   Yeonhi    Avante        15          13        195       782  0.249361

In [ ]:
# 5.2.3 GroupBy 객체를 이용한 분할, 적용, 통합
# 학교별 수학 성적에 분할, 적용, 통합 연산 실행

In [29]:
df = pd.DataFrame({'School' : ['Yeonhi', 'Yeonhi', 'Sungsan', 'Sungsan', 'Sungsan'],
                  'Name' : ['Haena', 'Gisu', 'Una', 'Naeun', 'Ziho'],
                  'Math_S' : [92, 70, 88, 92, 70]})
df

    School   Name  Math_S
0   Yeonhi  Haena      92
1   Yeonhi   Gisu      70
2  Sungsan    Una      88
3  Sungsan  Naeun      92
4  Sungsan   Ziho      70

In [55]:
mean_s = df.groupby('School')['Math_S'].agg('mean')
mean_s

School
Sungsan    83.333333
Yeonhi     81.000000
Name: Math_S, dtype: float64

In [56]:
mean_s.rename('Avg_S')

School
Sungsan    83.333333
Yeonhi     81.000000
Name: Avg_S, dtype: float64

In [57]:
avg_score = mean_s.rename('Avg_S').reset_index()
avg_score

    School      Avg_S
0  Sungsan  83.333333
1   Yeonhi  81.000000

In [58]:
df1 = df.merge(avg_score)
df1

    School   Name  Math_S      Avg_S
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

In [59]:
df['Rating_S'] = df['Math_S'].apply(lambda x: x/100)
df

    School   Name  Math_S  Rating_S
0   Yeonhi  Haena      92      0.92
1   Yeonhi   Gisu      70      0.70
2  Sungsan    Una      88      0.88
3  Sungsan  Naeun      92      0.92
4  Sungsan   Ziho      70      0.70

In [60]:
math_score = df['Math_S']

In [61]:
grade = []
for x in math_score:
    if x>90:
        grade = grade + ['A']
    elif x>80:
        grade = grade + ['B']
    elif x>70:
        grade = grade + ['C']
    else:
        grade = grade + ['F']
grade

['A', 'F', 'B', 'A', 'F']

In [62]:
df['Grade'] = grade

In [63]:
df

    School   Name  Math_S  Rating_S Grade
0   Yeonhi  Haena      92      0.92     A
1   Yeonhi   Gisu      70      0.70     F
2  Sungsan    Una      88      0.88     B
3  Sungsan  Naeun      92      0.92     A
4  Sungsan   Ziho      70      0.70     F

In [64]:
df['Avg_S'] = df.groupby('School')['Math_S'].transform('mean')
df

    School   Name  Math_S  Rating_S Grade      Avg_S
0   Yeonhi  Haena      92      0.92     A  81.000000
1   Yeonhi   Gisu      70      0.70     F  81.000000
2  Sungsan    Una      88      0.88     B  83.333333
3  Sungsan  Naeun      92      0.92     A  83.333333
4  Sungsan   Ziho      70      0.70     F  83.333333

In [65]:
df['Above_Avg'] = df['Avg_S'] < df['Math_S']
df

    School   Name  Math_S  Rating_S Grade      Avg_S  Above_Avg
0   Yeonhi  Haena      92      0.92     A  81.000000       True
1   Yeonhi   Gisu      70      0.70     F  81.000000      False
2  Sungsan    Una      88      0.88     B  83.333333       True
3  Sungsan  Naeun      92      0.92     A  83.333333       True
4  Sungsan   Ziho      70      0.70     F  83.333333      False

In [ ]:
# apply() 메소드 적용

In [69]:
def sort_math(dfs, n=3, column='Math_S'):
    return dfs.sort_values(by=column)[:n]

sort_math(df, n=5)

    School   Name  Math_S  Rating_S Grade      Avg_S  Above_Avg
1   Yeonhi   Gisu      70      0.70     F  81.000000      False
4  Sungsan   Ziho      70      0.70     F  83.333333      False
2  Sungsan    Una      88      0.88     B  83.333333       True
0   Yeonhi  Haena      92      0.92     A  81.000000       True
3  Sungsan  Naeun      92      0.92     A  83.333333       True

In [70]:
df.groupby('School').apply(sort_math, n=2, column = 'Rating_S')

            School   Name  Math_S  Rating_S Grade      Avg_S  Above_Avg
School
Sungsan 4  Sungsan   Ziho      70      0.70     F  83.333333      False
        2  Sungsan    Una      88      0.88     B  83.333333       True
Yeonhi  1   Yeonhi   Gisu      70      0.70     F  81.000000      False
        0   Yeonhi  Haena      92      0.92     A  81.000000       True

In [ ]:
# 5.2.4 기타 그룹 연산
# 불필요한 부분을 자동으로 제거

In [71]:
df = pd.DataFrame({'A' : ['ha', 'hi', 'ho', 'ha', 'ho'],
                   'B' : ['one', 'two', 'one', 'one', 'two'],
                   'Data1' : np.random.randn(5),
                   'Data2' : np.random.randn(5)})
df

    A    B     Data1     Data2
0  ha  one -1.060447  1.107626
1  hi  two -0.529765 -0.181499
2  ho  one -0.781511  1.121199
3  ha  one  0.110549 -2.331553
4  ho  two  0.762684 -0.705083

In [72]:
df.groupby('A').std()

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1072/3136877984.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').std()

       Data1     Data2
A
ha  0.828019  2.431867
hi       NaN       NaN
ho  1.091910  1.291376

In [ ]:
# 순서가 정렬된 요소를 그룹화

In [73]:
data = pd.Series(np.random.randn(16))
data

0     1.612899
1     0.634367
2    -1.198024
3    -0.721350
4    -0.193099
5    -0.228315
6     0.611954
7     1.215499
8     1.286133
9    -0.112937
10   -0.663784
11    0.321222
12    0.793947
13   -1.128215
14    1.723748
15   -0.022494
dtype: float64

In [74]:
factor = pd.qcut(data, [0, .25, .5, .75, 1.])
factor

0                    (0.899, 1.724]
1                    (0.149, 0.899]
2     (-1.1989999999999998, -0.337]
3     (-1.1989999999999998, -0.337]
4                   (-0.337, 0.149]
5                   (-0.337, 0.149]
6                    (0.149, 0.899]
7                    (0.899, 1.724]
8                    (0.899, 1.724]
9                   (-0.337, 0.149]
10    (-1.1989999999999998, -0.337]
11                   (0.149, 0.899]
12                   (0.149, 0.899]
13    (-1.1989999999999998, -0.337]
14                   (0.899, 1.724]
15                  (-0.337, 0.149]
dtype: category
Categories (4, interval[float64, right]): [(-1.1989999999999998, -0.337] < (-0.337, 0.149] < (0.149, 0.899] < (0.899, 1.724]]

In [75]:
data.groupby(factor).mean()

(-1.1989999999999998, -0.337]   -0.927843
(-0.337, 0.149]                 -0.139211
(0.149, 0.899]                   0.590373
(0.899, 1.724]                   1.459570
dtype: float64

In [ ]:
# 각 그룹의 행 확인하기

In [32]:
df = pd.DataFrame([[1, 2], [1, 4], [5, 6], [5, 8]], columns=['A', 'B'])
df

   A  B
0  1  2
1  1  4
2  5  6
3  5  8

In [33]:
gr = df.groupby('A')

In [34]:
gr.head(1)

   A  B
0  1  2
2  5  6

In [35]:
gr.tail(1)

   A  B
1  1  4
3  5  8

In [36]:
gr.nth(0)

   B
A
1  2
5  6

In [37]:
gr.nth(1)

   B
A
1  4
5  8

In [38]:
gr.nth(-1)

   B
A
1  4
5  8

In [39]:
df = pd.DataFrame([[1, np.nan], [1, 4], [5, 6], [5, 8]], columns=['A', 'B'])
df

   A    B
0  1  NaN
1  1  4.0
2  5  6.0
3  5  8.0

In [40]:
gr = df.groupby('A')

In [41]:
gr.nth(0)

     B
A
1  NaN
5  6.0

In [42]:
gr.nth(0, dropna='any')

     B
A
1  4.0
5  6.0

In [43]:
gr.first()

     B
A
1  4.0
5  6.0

In [44]:
gr.last()

     B
A
1  4.0
5  8.0

In [45]:
gr1 = df.groupby('A', as_index=False)
gr1.nth(0)

   A    B
0  1  NaN
2  5  6.0